Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/carers/payments_to_carers.html.txt.tmx
Source language: en
Languages: ga

source: Carers may be entitled to a number of supports from the Department of Social Protection
ga: D'fhéadfadh go mbeadh cúramóirí i dteideal tacaíochtaí éagsúla a fháil ón Roinn Coimirce Sóisialaí

source: If you are caring for someone, a disabled child or adult or an older person, you may qualify for a carer's payment
ga: Má dhéanann tú cúram baile de dhuine fásta nó leanbh atá faoi mhíchumas, d'fhéadfá cáiliú chun íocaíocht cúramóra a fháil

source: The two main social welfare payments for carers providing full-time care are Carer's Allowance and Carer's Benefit
ga: Tá dhá phríomhíocaíocht leasa shóisialaigh ann do chúramóirí atá ag tabhairt aire lánaimseartha do dhuine agus is iad sin Liúntas Cúramóra agus Sochar Cúramóra

source: You may also qualify for an annual Carer's Support Grant (formerly known as a Respite Care Grant)
ga: D'fhéadfá a bheith i dteideal an Deontas Cúraim Faoisimh bliantúil a fháil chomh maith

source: Carer's Benefit is a short-term payment paid for up to 24 months to people who give up employment to care on a full-time basis for someone who requires full-time care and attention
ga: Íoctar é ar feadh suas le 24 mí le daoine a fhágann an fórsa saothair chun cúram lánaimseartha a dhéanamh de dhuine a bhfuil cúnamh agus aire lánaimseartha de dhíth air/uirthi

source: After one year's service employees may take unpaid Carer's Leave of up to 2 years to provide full-time care for someone who needs it. Carer's Benefit may be paid during this time
ga: Tar éis bliain amháin oibre, tá sé de rogha ag fostaithe Saoire Chúramóra gan pá a thógáil chun cúram lánaimseartha a thabhairt do dhuine atá i ngátar cúraim agus d'fhéadfadh sé/sí bheith i dteideal an Sochar Cúramóra a fháil i rith na tréimhse seo

source: Additional payments are made if you are looking after more than one person
ga: Íoctar Sochar Cúramóra do gach duine a bhfuil tú ag tabhairt aire dóibh

source: If you do not qualify for Carer's Benefit you may qualify for Carer's Allowance
ga: Mura gcáilíonn tú le haghaidh Sochar Cúramóra, d'fhéadfá cáiliú chun Liúntas Cúramóra a fháil

source: Carer's Allowance is a payment for people who are caring on a full-time basis for someone who requires full-time care and attention and will require it for at least 12 months
ga: Is íocaíocht é an Liúntas Cúramóra do dhaoine a dhéanann cúram ar bhonn lánaimseartha de dhuine atá i ngátar cúraim agus a bheidh i ngátar cúraim ar feadh 12 mhí ar a laghad

source: You must satisfy a means test and the habitual residency condition
ga: Ní mór duit tástáil acmhainne agus an coinníoll gháthchónaí a shásamh

source: A half-rate Carer's Allowance is payable with certain other social welfare payments, this means that you can keep your main social welfare payment and get half-rate Carer's Allowance as well. If you get Carer's Allowance you are entitled to a Free Travel Pass
ga: Má fhaigheann tú íocaíochtaí leasa sóisialta áirithe agus tá cúram lán-aimseartha á sholáthar agat do dhuine eile, is féidir leat do phríomhíocaíocht leasa sóisialta a choinneáil agus Liúntas Cúramóra leath-ráta a fháil chomh maith

source: If the person you are caring for is under 16 you must be gettting Domiciliary Care Allowance to qualify for Carer's Allowance
ga: Nuair atá an duine atá faoi chúram faoi 16 bliana d'aois caithfidh go bhfuil Liúntas Cúram Baile á íoc ar a shon/son sula mbeidh sé/sí incháilithe do Liúntas Cúramóra

source: Domiciliary Care Allowance is a monthly payment made to the carer of a child with a severe disability who lives at home
ga: Íocaíocht mhíosúil é Liúntas Cúram Baile a dhéantar le cúramóir linbh a bhfuil míchumas trom air agus a bhfuil ina chónaí sa bhaile

source: When your child reaches 16 years of age he or she may qualify for Disability Allowance
ga: Nuair a bheidh an 16 bliana slán ag do pháiste, féadann sé/sí a bheith incháilithe do Liúntas Míchumais

source: If you continue to provide full-time care and attention for your child you can retain your carer's payment
ga: Má tá tú ag tabhairt cúraim agus aire ar bhonn lánaimseartha dó/di leanfar den íocaíocht cúramóra a íoc leat

source: If you are caring for a dependant child you may be entitled to an Incapacitated Child Tax Credit
ga: Is íocaíocht bhliantúil é an Deontas Cúraim Faoisimh

source: The Carer's Support Grant is an annual payment made to carers, aged 16 or over, providing full-time care for at least six months a year
ga: Íoctar é le cúramóirí atá 16 bliana d'aois nó mó agus a thugann aire ar bhonn lánaimseartha ar feadh sé mhí ar a laghad in aghaidh na bliana

source: However, this period must include the first Thursday in June
ga: Ní mór an chéad Déardaoin i Meitheamh a chur san áireamh sa tréimhse seo áfach

source: You are allowed to work for a certain number of hours each week
ga: Tá sé de rogha agat dul i mbun fostaíochta lasmuigh den teach ar feadh roinnt uaireanta in aghaidh na seachtaine

source: A Carer's Support Grant is paid for each person being cared for
ga: Íoctar an Deontas Cúraim Faoisimh do gach duine atá faoi chúram

source: If you are getting Carer's Allowance, Carer's Benefit or Domiciliary Care Allowance you do not need to apply for the grant, it is automatically paid to you in June
ga: Má fhaigheann tú Liúntas Cúramóra nó Sochar Cúramóra, ní gá iarratas a chur isteach do Dheontas, íocfar é go huathoibríoch i Meitheamh

source: Respite care can allow any carer to take a break from caring
ga: Tugann Cúram Faoisimh seans don chúramóir saoire a ghabháil ón gcúram atá a thabhairt aige/aici

source: Under the Homemaker's Scheme, if you give up work to care full-time for a child under 12 or a disabled child or adult, you may be able to have these years disregarded or not taken into account when your yearly average is calculated for your State Pension (Contributory)
ga: Faoin Scéim Déantóirí Baile, má fhágann tú an fórsa saothair chun cúram lánaimseartha a thabhairt do leanbh faoi 12 bhliain d'aois, do leanbh míchumasaithe nó do dhuine fásta, féadfaidh tú a chur faoi deara go ndéanfar neamhshuim de na blianta sin nuair atá an meánlíon bliantúil á ríomh chun críche Pinsin Seanaoise (Ranníocach)

source: There are a number of organisations that provide support and advice to carers
ga: Cuireann roinnt eagraíochtaí tacaíocht agus comhairle ar fáil do chúramóirí
